Router(config)#rou
Router(config)#router rip
Router(config-router)#ver
Router(config-router)#version 2
Router(config-router)#net
Router(config-router)#network 10.0.0.0
Router(config-router)#exit
Router(config)#rou
Router(config)#router 
% Incomplete command.
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#re
Router(config-router)#redistribute rip
Router(config-router)#redistribute rip su
Router(config-router)#redistribute rip subnets 
Router(config-router)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip rou
Router#show ip route 
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
O       10.1.1.0/24 [110/65] via 10.2.2.1, 01:24:59, FastEthernet0/0
C       10.2.2.0/24 is directly connected, FastEthernet0/0
C       10.3.3.0/24 is directly connected, Serial2/0
C       10.13.0.1/32 is directly connected, Loopback0
C       10.13.1.1/32 is directly connected, Loopback1
C       10.13.2.1/32 is directly connected, Loopback2
C       10.13.3.1/32 is directly connected, Loopback3
O IA 192.168.1.0/24 [110/129] via 10.2.2.1, 00:37:49, FastEthernet0/0
O IA 192.168.2.0/24 [110/193] via 10.2.2.1, 00:37:49, FastEthernet0/0

Router#show ip rip
% Incomplete command.
Router#show ip rou
Router#show ip route 
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
O       10.1.1.0/24 [110/65] via 10.2.2.1, 01:26:39, FastEthernet0/0
C       10.2.2.0/24 is directly connected, FastEthernet0/0
C       10.3.3.0/24 is directly connected, Serial2/0
C       10.13.0.1/32 is directly connected, Loopback0
C       10.13.1.1/32 is directly connected, Loopback1
C       10.13.2.1/32 is directly connected, Loopback2
C       10.13.3.1/32 is directly connected, Loopback3
O IA 192.168.1.0/24 [110/129] via 10.2.2.1, 00:39:29, FastEthernet0/0
O IA 192.168.2.0/24 [110/193] via 10.2.2.1, 00:39:29, FastEthernet0/0

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#rou
Router(config)#router rip
Router(config-router)#ver
Router(config-router)#version 2
Router(config-router)#exit
Router(config)#rou
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#redi
Router(config-router)#redistribute rip su
Router(config-router)#redistribute rip subnets 
Router(config-router)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
O       10.1.1.0/24 [110/65] via 10.2.2.1, 01:28:22, FastEthernet0/0
C       10.2.2.0/24 is directly connected, FastEthernet0/0
C       10.3.3.0/24 is directly connected, Serial2/0
C       10.13.0.1/32 is directly connected, Loopback0
C       10.13.1.1/32 is directly connected, Loopback1
C       10.13.2.1/32 is directly connected, Loopback2
C       10.13.3.1/32 is directly connected, Loopback3
O IA 192.168.1.0/24 [110/129] via 10.2.2.1, 00:41:12, FastEthernet0/0
O IA 192.168.2.0/24 [110/193] via 10.2.2.1, 00:41:12, FastEthernet0/0

Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to down

01:52:44: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.1.1 on FastEthernet0/0 from FULL to DOWN, Neighbor Down: Dead timer expired

01:52:44: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.1.1 on FastEthernet0/0 from FULL to DOWN, Neighbor Down: Interface down or detached

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

01:52:44: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.1.1 on FastEthernet0/0 from LOADING to FULL, Loading Done

Router#
Router#show ip ro
Router#show ip route 
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 7 subnets, 2 masks
O       10.1.1.0/24 [110/65] via 10.2.2.1, 00:03:33, FastEthernet0/0
C       10.2.2.0/24 is directly connected, FastEthernet0/0
C       10.3.3.0/24 is directly connected, Serial2/0
C       10.13.0.1/32 is directly connected, Loopback0
C       10.13.1.1/32 is directly connected, Loopback1
C       10.13.2.1/32 is directly connected, Loopback2
C       10.13.3.1/32 is directly connected, Loopback3
     172.20.0.0/16 is variably subnetted, 4 subnets, 2 masks
R       172.20.0.0/16 [120/1] via 10.3.3.2, 00:00:37, Serial2/0
R       172.20.0.0/24 [120/1] via 10.3.3.2, 00:00:10, Serial2/0
R       172.20.1.0/24 [120/1] via 10.3.3.2, 00:00:10, Serial2/0
R       172.20.2.0/24 [120/1] via 10.3.3.2, 00:00:10, Serial2/0
O IA 192.168.1.0/24 [110/129] via 10.2.2.1, 00:03:33, FastEthernet0/0
O IA 192.168.2.0/24 [110/193] via 10.2.2.1, 00:03:23, FastEthernet0/0

Router#
Router#








Router con0 is now available






Press RETURN to get started.













Router>wr mem
          ^
% Invalid input detected at '^' marker.
	
Router>en
Router>enable 
Router#wr mem
Building configuration...
[OK]
Router#